above
across
action
activity
actor
actress
add
address
adult
advice
afraid
after
afternoon
again
age
ago
agree
air
airport
all
always
amazing
and
angry
animal
another
answer
anyone
anything
apartment
apple
area
arm
around
arrive
art
article
artist
as
ask
aunt
awesome
baby
back
bad
bag
ball
banana
band
bank
bar
baseball
basketball
bath
bathroom
beach
beautiful
because
become
bed
bedroom
before
begin
beginning
behind
believe
below
between
bicycle
big
bike
bill
bird
birthday
black
blonde
blue
boat
body
book
bored
boring
born
both
bottle
box
boy
boyfriend
bread
break
breakfast
bring
brother
brown
build
building
bus
business
businessman
but
butter
buy
cafe
cake
call
camera
capital
car
card
career
carrot
carry
cat
cent
center
chair
change
chart
cheap
check
cheese
chicken
child
chocolate
choose
city
class
classroom
clean
climb
clock
close
clothes
club
coat
coffee
cold
college
color
come
common
company
compare
complete
computer
concert
conversation
cook
cooking
cool
correct
cost
country
course
cousin
cow
cream
create
culture
cup
customer
cut
dad
dance
dancer
dancing
dangerous
dark
date
daughter
day
dear
decide
delicious
describe
description
design
desk
detail
dialogue
dictionary
die
diet
difference
different
difficult
dinner
dirty
discuss
dish
doctor
dog
door
down
downstairs
draw
dress
drink
drive
driver
during
each
ear
early
east
easy
eat
egg
elephant
else
end
enjoy
enough
even
evening
event
ever
every
everybody
everyone
everything
exam
example
excited
exciting
exercise
expensive
explain
extra
eye
face
fact
fall
false
family
famous
fantastic
far
farm
farmer
fast
fat
father
favorite
feel
feeling
festival
fill
final
find
fine
finish
fire
first
fish
flight
floor
flower
fly
follow
food
foot
football
forget
form
free
friend
friendly
from
front
fruit
full
fun
funny
future
game
garden
geography
get
girl
girlfriend
give
glass
go
good
grandfather
grandmother
grandparent
gray
great
green
group
grow
guess
guitar
gym
hair
half
hand
happen
happy
hard
hat
hate
head
health
healthy
hear
help
here
high
history
hobby
home
homework
hope
horse
hospital
hot
hotel
hour
house
however
hungry
husband
ice
ice cream
idea
if
imagine
important
improve
include
information
interest
interested
interesting
interview
introduce
island
jacket
job
join
juice
keep
key
kind
kitchen
know
land
language
large
last
late
later
laugh
learn
leave
left
leg
lesson
letter
library
lie
life
light
like
line
lion
list
listen
live
local
long
look
loose
lot
love
lunch
machine
magazine
main
make
mall
man
map
market
married
match
meal
mean
meaning
meat
meet
meeting
member
menu
message
midnight
milk
minute
miss
mistake
model
modern
mom
moment
money
month
morning
most
mother
mountain
mouse
mouth
move
movie
museum
music
name
natural
near
need
negative
neighbor
never
new
news
newspaper
next
next to
nice
night
nobody
north
nose
note
nothing
now
number
nurse
object
ocean
o'clock
office
often
old
once
onion
online
only
open
opinion
opposite
or
orange
order
other
outside
own
page
paint
painting
pair
pants
paper
paragraph
parent
park
part
partner
party
passport
past
pay
pen
pencil
people
pepper
perfect
period
person
personal
phone
photo
photograph
phrase
picture
piece
pig
pink
place
plan
plane
plant
play
player
point
police
policemen
pool
poor
popular
positive
possible
post
potato
practice
prefer
prepare
present
pretty
price
probably
problem
product
program
project
purple
put
quarter
question
quick
quickly
quiet
quite
rain
read
reader
reading
ready
real
really
reason
red
relax
remember
repeat
report
restaurant
result
return
rice
rich
ride
right
river
road
room
routine
rule
run
sad
salt
same
say
school
science
scientist
second
section
see
sell
send
sentence
share
sheep
shirt
shoe
shop
shopping
short
show
shower
sick
similar
sing
singer
sister
sit
situation
skill
skirt
sleep
slow
small
smart
snake
snow
somebody
someone
something
sometimes
son
song
soon
sound
soup
south
space
speak
special
spell
spelling
spend
sport
spring
stand
star
start
statement
station
stay
still
stop
store
story
street
strong
student
study
style
subject
success
sugar
summer
sun
supermarket
sure
sweater
swim
swimming
table
take
talk
tall
tea
teach
teacher
team
teenager
telephone
television
tell
terrible
test
text
then
there
thing
think
thirsty
ticket
time
tired
title
today
together
toilet
tomato
tomorrow
tonight
tooth
topic
tourist
town
traffic
train
travel
tree
trip
truck
true
try
t-shirt
turn
twice
type
umbrella
uncle
under
understand
university
until
upstairs
use
useful
usually
vacation
vegetable
very
visit
visitor
wait
waiter
wake
walk
wall
want
warm
wash
watch
water
way
wear
weather
week
weekend
well
West
what
when
where
which
white
who
why
wife
win
window
winter
with
without
woman
wonderful
word
work
worker
world
write
writer
writing
wrong
yard
year
yellow
yesterday
young
