ability
able
abroad
accept
accident
according to
achieve
act
active
actually
adult
advantage
adventure
advertise
advertisement
advertising
affect
after
against
airline
alive
all
allow
almost
alone
along
already
alternative
although
among
amount
ancient
ankle
anybody
anymore
anyway
anywhere
appear
appearance
apply
architect
architecture
argue
argument
army
arrange
arrangement
as
asleep
assistant
attack
attend
attention
attractive
audience
author
available
average
avoid
award
awful
back
background
badly
bar
baseball
based
basketball
bean
bear
beat
beef
before
behave
behavior
belong
belt
benefit
best
better
bin
biology
birth
biscuit
bit
blank
blood
blow
board
boil
bone
book
borrow
boss
bottom
bowl
brain
bridge
bright
brilliant
broken
brush
burn
businessman
button
camp
camping
campus
can
candy
care
careful
carefully
carpet
cartoon
case
cash
castle
catch
cause
celebrate
celebrity
certain
certainly
chance
character
charity
chat
check
chef
chemistry
chip
choice
Church
Circle
classical
clear
clearly
clever
climate
close
closed
clothing
cloud
coach
Coast
code
colleague
collect
column
comedy
comfortable
comment
communicate
community
compete
competition
complain
completely
condition
conference
connect
connected
consider
contain
context
continent
continue
control
cook
cookie
cooker
copy
corner
correctly
count
couple
cover
crazy
creative
credit
crime
criminal
cross
crowd
crowded
cry
cupboard
curly
daily
danger
dark
data
dead
deal
death
decision
deep
definitely
degree
dentist
department
depend
desert
designer
dessert
destroy
detective
develop
device
diary
differently
digital
direct
direction
director
disagree
disappear
disaster
discover
discovery
discussion
disease
distance
divorced
document
double
download
downstairs
drama
drawing
dream
drive
driving
drop
drug
dry
earn
Earth
easily
education
effect
either
electric
electrical
electricity
electronic
employ
employee
employer
empty
ending
energy
engine
engineer
enormous
enter
environment
equipment
error
especially
essay
everyday
everywhere
evidence
exact
exactly
excellent
except
exist
expect
experience
experiment
expert
explanation
express
expression
extreme
extremely
factor
factory
fail
fair
fall
fan
farm
farming
fashion
fat
fear
feature
feed
female
fiction
field
fight
figure
film
final
finally
finger
finish
first
firstly
fish
fishing
fit
fix
flat
flu
fly
flying
focus
following
foreign
forest
fork
formal
fortunately
forward
free
fresh
fridge
frog
fun
furniture
further
future
gallery
gap
garbage
gas
gate
general
gift
goal
God
gold
golf
good
government
grass
greet
ground
guest
guide
guy
habit
half
hall
happily
headache
heart
heat
heavy
height
helpful
hero
hide
hill
hit
hockey
hold
hole
home
hope
huge
human
hurt
ideal
identify
ill
illness
image
immediately
impossible
included
including
increase
incredible
independent
individual
industry
informal
injury
insect
inside
instead
instruction
instructor
instrument
intelligent
international
introduction
invent
invention
invitation
invite
involve
item
jam
jewelry
joke
journalist
jump
kid
kill
king
knee
knife
knock
knowledge
lab
lady
lake
lamp
land
last
later
laughter
law
lawyer
lazy
lead
leader
learning
least
lecture
lemon
lend
less
level
lifestyle
lift
light
likely
link
listener
lock
look
lorry
lost
loud
loudly
lovely
low
luck
lucky
mail
major
male
manage
manager
manner
mark
marry
material
math
mathematics
matter
media
medical
medicine
memory
mention
metal
method
middle
mind
mirror
missing
mobile
monkey
moon
mostly
motorcycle
movement
musical
musician
narrow
national
nature
nearly
necessary
neck
need
neither
nervous
network
noise
noisy
none
normal
normally
notice
novel
nowhere
number
nut
ocean
offer
officer
oil
opportunity
option
ordinary
organization
organize
original
outside
oven
own
owner
pack
pain
painter
palace
pants
parking
particular
pass
passenger
past
patient
pattern
pay
peace
penny
per
percent
perform
perhaps
permission
personality
pet
petrol
photograph
physical
physics
pick
pilot
planet
plant
plastic
plate
platform
please
pleased
pocket
polite
pollution
population
position
possession
possibility
poster
power
predict
present
president
prevent
print
printer
prison
prize
process
produce
professional
professor
profile
program
progress
promise
pronounce
protect
provide
Pub
public
publish
pull
purpose
push
quality
quantity
Queen
question
quietly
race
Railway
raise
rate
rather
reach
react
realize
receive
recent
recently
reception
recipe
recognize
recommend
record
recording
recycle
reduce
refer
refuse
region
regular
relationship
remove
repair
replace
reply
report
reporter
request
research
researcher
respond
response
rest
review
ride
ring
rise
Rock
role
roof
round
route
rubbish
rude
run
Runner
running
sadly
safe
sail
sailing
salary
sale
sauce
save
scared
scary
scene
schedule
score
screen
search
season
seat
second
secondly
secret
secretary
seem
sense
separate
series
serious
serve
service
several
shake
shape
sheet
ship
shoulder
shout
shut
side
sign
silver
simple
since
singing
single
sir
site
size
ski
skiing
skin
sky
sleep
slowly
smell
smile
smoke
smoking
soap
soccer
social
society
sock
soft
soldier
solution
solve
somewhere
sort
source
speaker
specific
speech
speed
spider
spoon
square
stage
stair
stamp
star
start
state
stay
steal
step
stomach
stone
storm
straight
strange
strategy
stress
structure
stupid
succeed
successful
such
suddenly
suggest
suggestion
suit
support
suppose
sure
surprise
surprised
surprising
survey
sweet
symbol
system
tablet
talk
target
task
taste
teaching
technology
teenage
temperature
term
text
thick
thief
thin
thinking
third
thought
throw
tidy
tie
tip
tool
top
touch
tour
tourism
toward
towel
tower
toy
track
tradition
traditional
train
trainer
training
transport
trash
traveler
trouble
truck
twin
typical
underground
understanding
unfortunately
unhappy
uniform
unit
United
unusual
upstairs
use
used to
user
usual
valley
variety
vehicle
view
voice
wait
war
wash
washing
wave
weak
wedding
weight
welcome
what
wet
wheel
while
whole
whose
wide
wild
wind
winner
wish
wood
wooden
working
worried
worry
worse
worst
yet
zero
