absolutely
academic
access
accommodation
account
achievement
act
ad
addition
admire
admit
advanced
advise
afford
age
aged
agent
agreement
ahead
aim
alarm
alternative
amazed
ambition
ambitious
analyze
analysis
announce
announcement
annoy
annoyed
annoying
apart
apologize
application
appointment
appreciate
approximately
arrest
arrival
assignment
assist
atmosphere
attach
attitude
attract
attraction
authority
average
award
aware
backward
bake
balance
ban
bank
base
basic
basis
battery
battle
beast
bee
belief
bell
bend
benefit
better
bite
block
board
border
bother
branch
brand
brave
breath
breathe
breathing
bride
bubble
bury
calm
campaign
campus
candidate
cap
captain
careless
category
ceiling
celebration
center
central
ceremony
chain
challenge
champion
channel
chapter
charge
cheap
cheating
cheerful
chemical
chest
childhood
claim
clause
clear
clever
click
client
close
cloth
clue
coach
coal
coin
collection
colored
combine
comment
commercial
commit
communication
comparison
competitive
competitor
complaint
complex
concentrate
conclude
conclusion
confident
confirm
confuse
confused
connection
consequence
consist
consume
consumer
contact
container
content
continuous
contrast
convenient
convince
cool
costume
Cottage
count
Countryside
Court
cover
covered
cream
Criminal
cruel
cultural
currency
current
currently
curtain
custom
cut
daily
damage
deal
decade
decorate
Define
definite
definition
deliver
departure
despite
destination
determine
determined
development
diagram
diamond
difficulty
Direct
directly
dirt
disadvantage
disappointed
disappointing
discount
dislike
divide
documentary
donate
double
doubt
dressed
drop
drum
drunk
dust
Duty
earthquake
Eastern
economic
economy
Edge
editor
educate
educated
educational
effective
effectively
effort
election
element
embarrassed
embarrassing
emergency
emotion
employment
empty
encourage
enemy
engaged
engineering
entertain
entertainment
entrance
entry
Environmental
episode
equal
equally
Escape
essential
eventually
examine
except
Exchange
excitement
exhibition
expand
expected
Expedition
experience
experienced
explode
explore
explosion
export
extra
face
fairly
familiar
fancy
far
fascinating
fashionable
fasten
favor
fear
feature
fence
fighting
file
financial
fire
fitness
fixed
flag
flood
flour
flow
fold
folk
following
force
forever
foreign
frame
freeze
frequently
friendship
frighten
frightened
frightening
frozen
fry
fuel
function
fur
further
garage
gather
generally
generation
generous
gentle
gentlemen
ghost
Giant
glad
global
glove
ago
Goods
grade
graduate
grain
grateful
growth
guard
guilty
hand
hang
happiness
hardly
hate
head
headline
Heating
heavily
helicopter
highlight
highly
hire
historic
historical
honest
horrible
horror
host
hunt
hurricane
hurry
identity
ignore
illegal
imaginary
immediate
immigrant
impact
import
importance
impression
impressive
Improvement
incredibly
indeed
indicate
indirect
indoor
indoors
influence
ingredient
injure
injured
innocent
intelligence
intend
intention
invest
investigate
involved
iron
issue
Journal
judge
Keen
key
keyboard
kick
kind
kiss
knock
label
Laboratory
lack
latest
lay
layer
lead
leading
leave
leather
legal
leisure
length
level
lie
like
limit
lip
liquid
literature
live
living
local
locate
located
location
lonely
loss
luxury
mad
magic
mainly
mall
management
market
marketing
marriage
meanwhile
measure
medium
mental
mention
mess
mild
mine
mix
mixture
mood
move
mud
muscle
musical
mystery
nail
narrative
nation
native
naturally
necessarily
needle
neighborhood
neither
net
next
normal
northern
note
now
nuclear
obvious
obviously
occasion
occur
odd
official
old-fashioned
once
operation
organized
organizer
original
originally
outdoor
outdoors
pack
package
painful
pale
pan
participate
particularly
pass
passion
path
payment
peaceful
percentage
perfectly
performance
personally
persuade
photographer
photography
pin
pipe
place
planning
Pleasant
pleasure
plenty
plot
poem
poet
poetry
point
poison
poisonous
policy
political
politician
politics
port
portrait
possibly
pot
pour
poverty
powder
powerful
practical
pray
prayer
prediction
prepared
presentation
press
pressure
pretend
previous
previously
priest
primary
prince
princess
printing
prisoner
private
producer
production
profession
profit
program
promote
proper
properly
property
protest
proud
prove
pull
punish
punishment
push
qualification
qualified
qualify
queue
quit
quotation
quote
race
racing
raise
range
rare
rarely
reaction
reality
receipt
recommendation
reference
reflect
regularly
reject
relate
related
relation
relative
relaxed
relaxing
release
reliable
religion
religious
remain
remind
remote
rent
repair
repeat
repeated
represent
request
require
reservation
resource
respect
responsibility
responsible
result
retire
retired
revise
ring
rise
risk
roll
romantic
rope
rough
row
royal
rugby
rule
safety
sale
sailor
sand
scan
scientific
script
sculpture
secondary
security
seed
sensible
separate
seriously
servant
set (1)
set (2)
setting
Shake
share
Sharp
Shelf
shell
shift
shine
shiny
shoot
shy
sight
signal
silent
silly
similarity
similarly
simply
since
sink
slice
slightly
slow
smart
smooth
software
soil
solid
sort
southern
specifically
spending
spicy
spirit
spoken
spot
spread
spring
stadium
staff
standard
state
statistic
statue
stick (1)
stick (2)
still
store
stranger
strength
string
strongly
studio
stuff
substance
successfully
sudden
suffer
suit
suitable
summarize
summary
supply
supporter
surely
surface
survive
swim
switch
symptom
tail
talent
talented
tape
tax
technical
technique
tend
tent
that
theme
theory
therefore
this
though
throat
throughout
tight
till
tin
tiny
tip
tire
toe
tongue
total
totally
touch
tour
trade
trainer
translate
translation
transport
treat
treatment
trend
trick
truth
tube
type
typically
ugly
unable
uncomfortable
underwear
unemployed
unemployment
unfair
union
unless
unlike
unlikely
unnecessary
unpleasant
update
upset
used
valuable
value
various
version
victim
view
viewer
volunteer
vote
warm
warn
warning
waste
water
wave
Western
whatever
whenever
whether
while
whole
will
win
wing
within
wonder
wool
worldwide
worry
worse
worst
worth
written
wrong
yard
young
youth
